app/controllers/tournaments_controller.rb

  def jsontournament
  	tournaments = Tournament.all
---
SELECT "tournaments".* FROM "tournaments"

  def destroy
  	tournament = Tournament.find_by(id: params[:id])
  	if tournament
  		tournament.destroy
---
SELECT  "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = ? LIMIT 1  [["id", 6]]
DELETE FROM "tournaments" WHERE "tournaments"."id" = ?  [["id", 6]]